# encoding:utf-8
import time

import requests
import pandas as pd

# 百度地图 API
url = "https://api.map.baidu.com/place/v3/suggestion"

# AK
ak = "f2XDirOzk2uD4h0LQ1mK5snTFqjFqSLs"

# 关键词列表
names = ['阿兹特克', '爱幕依影视', '安创蓓康', '安骑', '安瑞森电子材料', '安替奔达', '百捷智达', '百瑞源枸杞股份', '半亩良人研究', '半亩良人智慧', '宝塔股份', '北阀智控', '北方益农', '北京同仁堂健康药业', '北控宝盈商务', '博尔特', '车主驿站', '辰卓', '成电创孵', '成电创智', '川宁电缆', '大华医疗', '大象电力', '德尚知识产权咨询', '鼎川电缆股份', '东方联鸣', '东方塑力线缆', '斗牛士', '恩泽斯环境', '凡雀创意', '非凡智慧', '丰利源', '弗润德力股份', '共享铸造创新中心', '共享装备', '共享铸钢',
         '共享装备股份', '冠检检测', '广煜', '国能发电', '国网综合能源', '国智知识产权', '果壳', '海江建设', '汉风风电', '和乐邦家居', '神  国际葡萄酒庄', '四海综贸', '县德林果蔬产销专业合作社', '县海超农机作业', '县华农益农果蔬产销专业合作社', '县晶诚水产养殖', '县立岗镇永兴稻谷产销专业合作社', '县泰鑫冶炼', '县欣荣和食用菌', '贺享红', '恒源智同物联', '鸿利项目管理', '华佰', '华多', '华发容器', '华固', '华赫', '华盛龙', '华泰昌职业培训学校', '华夏碧水', '华夏源爱济', '华新智股份', '华域',
         '华泽宜通', '华筑之影', '寰娱互动', '徽仁', '徽仁', '嘉磊', '交大检测', '杰信达建设', '金开智维', '金石机器人', '景丰能源', '九洋杂粮开发', '巨冈精工', '锎量', '康膜', '克里蒂弗', '朗坤区块链', '联创万通', '联创万通', '市大地粮油食品', '市峰瑞农牧专业合作社', '市海峰阳光彩印包装', '市海江种植专业合作社', '市浩珲工贸', '市恒业有色金属冶化', '市嘉勇牧业', '市建鑫塑料制品', '市金科环境', '市临河镇滨河长枣专业合作社', '市农盛种植专业合作社', '市少军奶牛养殖专业合作社', '市同心综合开发',
         '市夏能供销合作社', '市欣兴饲草', '市鑫海建材', '市鑫盛达牧业', '市鑫旺达农牧', '市幸福牛牧业', '市叶氏兄弟夏能', '市伊山河食用油', '市银春祥工贸', '市御富洋农牧', '市众宏草制品', '凌志飞扬', '龙光', '洛客', '绿盾征信信用评级评估中心', '绿藤设备', '绿源恒森安环', '绿源恒森安环', '阿加德米学园教育', '阿萨粮油食品', '阿色羔', '埃德曼设备', '艾克德机械', '艾普森', '艾威鑫电子', '艾伊研发', '艾依斯数据统计调研', '爱济莱斯', '爱就定服装设计', '安保', '安达远', '安防机电', '安广恒',
         '安合成化工', '安和通', '安检', '安捷特种设备安全附件检测', '安立信电力', '安利森', '安品绿源', '安普安全咨询', '安谱检测', '安正科贸', '奥格瑞电气', '奥能', '奥群', '澳中健康', '巴斯孚', '百川电力股份', '百川通清洁能源', '百创', '百航馨劳务', '百润', '百旺中税', '百益生', '百优珍选', '柏盛装备', '柏讯远通科贸', '栢通系统', '宝立设计研究院', '宝利兴能源利用', '宝通仁和', '宝芝红枸杞', '保利节能', '保隆', '报业传媒创意', '报业传媒印刷', '北瓷', '北斗宇航', '北方高科工业', '北方乳业',
         '北伏', '北国节能', '北国检测', '北华瑞尔电气', '北极星化工', '北起教育', '北仁', '北滩鲜', '北图', '贝壳', '贝瑞斯曼', '贝易医疗器械', '犇旺生态', '毕利格建设', '彬洋', '铂泽', '博安', '博晟伟业建设', '博得石膏研究院', '博尔特医疗测试研究院', '博尔特医疗研究院', '博工氟塑装备', '博科咨询', '博控系统', '博瑞基业消防', '博瑞', '博瑞饲料', '博思高', '博思通', '博思通', '博伟金属制品', '博旭实验室设备', '博源众航水利咨询', '博远橡胶', '才运达机电泵业', '彩虹桥物联', '菜鲜生生鲜配送',
         '草原阿妈食品', '草源华禹食品', '测衡联合', '昌禾同盛', '昶蒂建设', '畅度教育', '畅兴泰照明', '超高压电力', '超合电力物资', '辰朗设备', '晨禹水利水电', '成建', '诚达', '诚德汽车轴承', '诚锋启航电力设备', '诚美佳工贸', '诚盛电气', '诚顺达电力', '城安建设', '城际', '城建设计研究院', '城农网电力', '城市快线供应链', '晟标认证', '晟博建工', '晟睿熙工贸', '晟睿熙', '铖锋钢构', '初心教育', '厨佬哥食品加工', '储芯', '川流天下供应链管理', '创成索福门业', '创格', '创科', '创胜', '创新荣工贸',
         '创新伟业', '创耀信', '春田牧业', '达疆', '大北农', '大诚同方软件开发', '大诚至信新型材料', '大地坤融', '大多石油装备再', '大丰装饰', '大光节能', '大河九洲传媒', '大润牧农产品开发', '大象电子商务', '大亚木业', '大一食品', '丹辰', '丹富粮油食品', '德财财税管理咨询', '德晟邦安', '德峰牧业', '德坤', '德坤环境研发', '德朗宁铝业', '德瑞斯', '德森建设', '德圣亚', '德沃酒庄', '德云泽', '地德', '地丰', '地信', '地质勘察院', '迪安医学检验中心', '第三', '电力能源', '电通物联网股份', '电通',
         '顶赛安全', '鼎峰致远', '鼎弘供应链管理', '鼎宏包装制品', '鼎盛宁康奶牛养殖', '鼎顺金属制品', '鼎翔通信', '东峰钢结构', '东海装饰', '东和化工', '东狐知识产权咨询', '东凯电力', '东来能源运输', '董洋食品配送', '动感飞扬传媒', '嘟嘟', '盾安拓克', '盾源聚芯半导体股份', '多力新型材料', '多林', '多维药业', '多闻股份', '恩典应急物资制品', '恩曼', '恩泽教育', '凡天', '泛恩智控', '泛在', '方博', '方达系统', '方盛管业', '飞浩园管道', '飞龙海大数据', '飞龙海', '飞通', '飞岩锦诚', '菲华通控制',
         '菲杰特检测', '菲特电子产品', '丰源办公家具', '丰植源现代开发', '峰火', '峰瑞牧业', '烽火台数据', '锋利', '凤城装备', '凤凰天地设备', '凤仪堂', '弗伦凯尔机械设备', '福得多玻璃', '福德电气', '福聚多玻璃', '福美材料', '福宁设计咨询', '福思泰装备', '福兴神农食品', '富疆种业', '富利莱家具', '富隆德流体', '富盛源', '富时罗广告传媒', '富仕丰', '富水化工', '富杨食品', '甘定起重机设备', '高创特能源', '高德电缆', '高鸿', '高源银色高地葡萄酒庄', '工业和化研究院', '工业设计院', '公路质量检测中心',
         '公路质量检测中心', '公路勘察设计院', '拱福生态', '共享化工', '共享机床辅机', '共享精密加工', '共享能源', '共赢通工业', '谷芝', '固德金属结构', '观天融创', '光驰', '光达合汇', '光瑞', '广庆食品', '广天夏股份', '广银米业', '广筑予景咨询', '贵军农牧', '国斌亚琦纺织', '国富汇', '国富建设', '国基建设', '国通数智', '国投金融', '国新环境', '国信检研', '国源', '海归孵化器', '海量', '海美祥建设', '海森建材', '海通电子', '海沃空间企业管理', '海洋线缆', '海永生态农牧', '海之源', '涵韬',
         '汉威科交通', '汉尧富锂', '翰和建设', '瀚翔伟业', '夯中岩土', '航帆', '航海', '航锦', '航空食品', '航天数景', '航天', '好光景光电', '好家乡生态', '昊标检测研究院', '昊标检测研究院', '昊昌机械再', '昊海天诚', '昊盛达农牧', '昊王米业', '昊新牧业', '昊旭畜牧养殖', '昊玉种业股份', '昊玉种业', '昊裕油脂', '昊允天', '浩民', '浩荣飞', '浩润佰鼎招标代理', '浩宜新建设', '晧顺建设', '合成', '合汇', '合牧', '合强伟业', '合义诚电器', '合智激光', '合众赢工贸', '和光同瑞数字', '和君纵达数据',
         '和仁堂口腔门诊', '和瑞包装', '和谐联工贸', '和信通机电设备', '河海咨询管理', '贺丰种业', '山东麓葡萄酒创新中心', '山东麓葡萄酒创新中心', '山国家森林公园', '鹤泉葡萄酒', '恒康', '恒力祥自控', '恒盛大通工贸', '恒泰化工设备', '恒泰', '恒为电力设计', '恒兴世纪', '恒耀建设', '恒亿泰机房设备', '衡通计量检测', '弘地设计院', '弘茂特种设备检验检测', '弘泽开发', '红禾种子', '红松鼠', '红泰通达玻璃', '红阳合粮油', '宏德环境股份', '宏德环境', '宏茂农林', '宏瑞建设', '宏信亿诚', '宏亚至诚知识产权',
         '宏宇智创', '宏禹检测', '宏禹检测', '宏源建科检测', '宏源长城机床', '泓盈视联', '洪栋机械', '浤森', '鸿沣危险货物运输', '鸿科', '鸿荣乡情农牧产销专业合作社', '鸿睿鑫电子', '鸿旭环境', '鸿雅创新', '鸿缘祥食品', '鸿泽新', '厚德', '厚生记枸杞饮品股份', '厚生记食品', '厚壹', '厚源自控', '华澳牧业', '华晟节能', '华鼎', '华冠', '华昊', '华辉股份', '华锦售电', '华琳源农牧', '华淼建设', '华能达开发', '华嵌', '华瑞农开发', '华瑞星景观', '华盛牧歌饲料', '华盛星美传媒', '华泰家俱', '华图测绘',
         '华望', '华西振兴水利', '华鑫融通', '华信达健康', '华严趣链', '华洋砼业', '华业精细化学', '华溢', '华缨', '华裕', '华源万盛电力设计', '华远数绘', '城市', '环境科学研究院', '环筑建设', '幻影云', '唤希', '黄河玫瑰园林', '灰熊', '辉熠建设', '辉宇鑫建材', '回族自治区电力设计院', '回族自治区石油化工环境科学研究院股份', '回族自治区水产研究所', '回族自治区通信', '汇邦泽软件', '汇晟', '汇川服装', '汇达线缆', '汇力达工业控制', '汇力能源', '汇能朋博能源', '汇融升', '汇信德咨询', '汇岩达节能咨询',
         '汇智云端', '惠泽招', '慧图', '慧玩', '慧雅居', '慧英电力', '慧源建设研究院', '慧源建设研究院', '慧源项目管理', '机械研究院股份', '机要印刷', '吉虎', '极客空间', '集佳', '几字湾数字', '计算机软件与', '济川中科', '加速', '佳华铝业', '佳瓴', '佳仕德水处理', '佳智星', '迦南美地酒庄', '家安', '家家食用油', '家苗跃农机作业', '嘉宝信金融仓储', '嘉地酒园酒庄', '嘉立特', '嘉隆', '嘉农', '嘉适元物联', '简墨碳素新材', '建博装配式', '建成建材', '建成砼业', '建大', '建设投资钢结构', '建设投资岩土',
         '建设投资装饰', '建投设计研究总院', '建兴', '材料产品质量监督检验站', '科学研究院股份', '健力肽', '江东朔', '交建交通研究院', '交通科学研究所', '交投', '角弓鸣电子竞技', '杰佳', '杰力设备', '杰农种业', '杰申精密机械', '杰唯', '杰讯软件', '洁境', '洁之安环境治理', '捷能通数字', '金诚杰软件开发', '金川交联线缆', '金丰易化工', '金海农牧', '金海皮业', '金凯胜工贸', '金科广汇', '金灵州种业', '金目鼎盛', '金苹果', '金瑞宸', '金润昌', '金圣华机械', '金双禾粮油', '金丝路大数据', '金拓路',
         '金太阳药业', '金夏米业', '金芯', '金兴顺牧业', '金宇智慧', '金域医学检验所', '锦沣电力设计', '锦枫', '锦亮电力', '锦隆试验检测', '锦秋', '锦润生态建设', '锦硕', '锦泰弘', '锦旺', '锦绣世纪', '锦元精密机械', '京辉建设', '京添一一', '京铁卫士保安', '京武波纹管', '京芯软件开发', '泾银化工', '晶创装备', '晶环', '晶润食品', '晶英光伏', '精捷彩色印务', '精盛输送机械', '景枫园林绿化', '景泓项目管理', '景沃佳禾', '九福伟业农村电商', '九三零生态农牧', '九昇开发', '九盛牧业研究院',
         '九盛牧业研究院', '九源财税', '九州人力资源', '久瓦能源', '玖柏三维', '玖功', '玖卉传媒', '玖泰银', '玖玥纺织', '巨丰种苗', '巨恒自控电器', '巨能机器人股份', '巨日现代', '巨泰', '巨正', '鉅诚精机', '君磁', '君盾', '君明利牧农牧', '君盛', '君陶', '君望咨询', '君泽消防检测', '俊鹏市政园林', '骏兴达', '凯晨电气', '凯达通建设', '凯迪亿德设备', '凯力特', '凯盛源开发', '凯斯德机电', '凯速德', '凯拓', '凯拓', '凯泰特', '凯添燃气股份', '凯信特', '凯泽建设', '凯珠机械化', '康晟乐农牧', '康大',
         '康乐达互联网', '康泰隆中药饮片', '康亚药业股份', '康扬中药材', '科博', '科尔福特数控', '科丰种业', '科衡', '科鸿控制系统', '科华电力', '科吉互联网', '科竣', '科梦奇人工', '科楠电工', '科锐达设备', '科瑞恒生', '科瑞洁环境', '科泰种业', '科特包装印刷', '科腾建设', '科为', '科星咨询', '科易网', '科优种业', '科育种苗', '科正检测', '空间', '酷客教育', '坤达', '坤生建设', '鲲鹏电子商务', '莱芝智慧生态', '兰星现代', '蓝盾创鑫安全', '蓝晶', '蓝净能源', '蓝图', '蓝湾生态', '蓝因', '朗润环境',
         '朗月', '老哈机械设备', '涝河桥肉食品配送', '乐承致家', '乐道物联网', '乐道股份', '乐民', '乐清', '雷利祥', '磊峰兄弟机械作业', '力成电气', '力控电气', '力行研究院', '力源', '立宸开发', '立思辰银山教育', '立韦', '利思', '利思葡萄酒庄', '联权绒业开发', '联星', '量智云', '燎原远大阀门销售', '邻迹', '林盛元建设', '灵浩工贸', '灵树', '灵朔电子商务', '市金岭农牧', '灵州雪服装股份', '聆音', '零星', '领航保温材料', '领航岩棉', '领航者低空飞行', '领世', '领新耘智空间', '留世葡萄酒庄', '六德原',
         '六盘峰云', '六维金融', '龙凤制衣', '龙津消防安全', '龙塞电气设备', '龙山御景', '龙翔建设检测', '隆合', '隆基电气', '隆基乐叶', '隆基宁光仪表股份', '隆利鑫机械设备', '隆盛经济开发', '隆通', '鲁银检测', '橹丽', '路广通公路试验检测', '路易', '绿博种子', '绿川', '绿方水产良种繁育', '绿歌', '绿稼源', '绿农园牧业', '绿色世纪', '绿色之星', '绿森农副产品', '绿社盛世园林绿化', '绿天果业', '绿网', '绿先锋', '绿叶', '绿源', '绿展投资', '绿筑集成', '迈克龙力工贸', '迈奇创想', '麦尔乐食品股份',
         '麦芒', '满源机械设备安装', '茂鑫源汽车运输', '媒眼供应链管理', '煤炭基本建设', '煤炭科学研究所', '美邦寰宇化学', '美极鲜蔬菜配送', '美科医疗器械', '美通', '美欣进', '美尊', '萌生砼业', '迷庐传播', '米客食品', '米赛尔机械设备', '绵洋洋食品', '民江钢化玻璃', '闽宁汇盛商务', '名乾', '明宝新型涂料', '明道', '明途试验检测', '明翔粮油', '铭华君盛农牧', '铭悦达塑料包装', '莫克仪表', '墨工', '木尔马建材', '木易云文教育咨询', '沐思', '牧江', '慕森电力', '慕葳睡眠', '穆华香食品', '穆勒电气',
         '奶瓜瓜', '奶牛研究所', '奶牛研究所', '耐邦供水设备', '宁宝世家食品', '宁宝印刷', '宁博通模板', '宁创智思', '宁电电力设计', '宁电消防设备', '宁东华晟节能', '宁东科慧数运大数据', '宁东创业投资', '宁东科控大数据', '宁聚油田材料', '宁铼', '宁苗绿博苗木', '宁苗生态建设股份', '宁企典知识产权代理', '宁企信知识产权咨询', '宁羴源牛羊肉', '宁深禾望电气', '宁硕精密', '宁信', '宁银', '农夫田园商贸', '农垦平吉堡农场', '农垦乳制品', '农林科学院畜牧兽医研究所', '诺克银丰', '诺鲜程', '欧创机械',
         '欧斯曼电子商务', '欧韵新型材料', '磐泰能源', '沛信建设', '朋众', '鹏丰种业', '品禾', '葡萄酒职业技能培训学校', '璞石', '普利特开发', '普凌企业管理', '普凌', '普天动能', '普信', '齐鑫伟业', '祁源生态', '奇客摩克教育', '奇略源咨询', '淇霖农牧', '祺祥安防雷', '企服网', '企通', '杞乐康食品开发', '杞蕴现代生态', '启动', '启航开发', '启汇', '启旭', '启元国药', '启元药业', '启钺建设', '启之源测绘', '千弓预应力', '芊艺', '乾广生态', '乾能低碳开发', '强铝', '乔锋机械', '乔阳', '巧玲', '秦晟达',
         '秦联能源', '秦杨中医医院', '青川管业', '青龙塑料管材', '青鑫天一节能', '清洁机制中心', '清穆食品', '趣淘健康食品', '全晟达空间', '全盛金属表面处理', '人和管业', '认养一头牛牧业', '茸源养殖', '荣邦电力', '荣光电节能', '荣光电力', '荣和绿色', '荣林生态', '榕科矿山机械', '融汇丰建设', '融汇丰生态', '融利源供应链管理', '融媒', '软件院', '锐驰', '锐航创新咨询', '锐思互动传媒', '瑞辰', '瑞鼎', '瑞光博远', '瑞能工贸', '瑞奇欧商贸', '瑞斯软件', '瑞威尔能源环境', '瑞沃水资源研究院', '瑞信开发',
         '瑞银铅资源再生', '瑞银有色金属', '睿创节能', '睿途', '睿星力衡计量检测中心', '睿源精细化工', '润邦门窗幕墙', '润达电气', '润丰种业', '润禾丰', '润农节水', '润宇泽节能', '润泽丰源法律咨询', '塞柏', '塞上金裕食用油', '塞上牧场食品', '塞上牧源牧业', '塞上杞园食品', '塞上迎鑫农牧', '塞上置业', '塞尚乳业', '赛福质量检测', '赛洛丝', '赛马科进混凝土', '赛马水泥', '赛斯聚信', '赛文股份', '三爱', '三才', '三产融合', '三丁湖', '三恒电线电缆', '三瑞机械设备', '三十六度', '三思', '三谊',
         '三正管业', '三正世通橡塑', '森创环境', '森蓝', '森润牧业开发', '山逗子杂粮绿色食品开发', '山水相遇', '善庆装备', '善途', '上恒食品', '上业安泰工贸', '上泽龙水利水电', '尚辰电力', '尚蓝', '尚锐', '尚信酬勤', '尚屹', '尚禹节水', '申和', '神奇之鸟陶瓷', '神耀', '神州好易股份', '升世隆泰电气', '圣普', '圣友德', '胜聚', '胜威电力设备', '盛澳源牧业', '盛华保温材料', '盛晖', '盛景咨询', '盛康生态建设', '盛世创业电子', '盛世华欣电气开关', '盛世绿源环境检测', '盛天彩数字股份',
         '石化银骏安全咨询', '时代森淼家具', '时星', '实德新型建材', '拾悦酒业', '食鲜汇供应链管理', '世纪创想', '世纪信通安全', '书云', '蜀佳农牧', '数创', '数据股份', '帅玺品牌管理', '双玉防水防腐材料', '双玉防水材料', '水利水电勘测设计研究院', '水林尘电子商务', '水投股份', '水投清水河城乡供水', '水投清水源水处理', '水投云澜股份', '顺邦达', '顺控', '顺通塑业', '舜昌亚麻纺织', '瞬剪', '硕邦电线电缆', '丝路风情股份', '丝路明珠', '思博', '思和电子', '思极', '思捷易网科贸', '思睿能源管理', '思翔',
         '思学', '思远', '四季青冷链物流', '四季优鲜现代', '苏川', '苏客隆仓储设备', '苏洋传媒', '索特科新型器件', '塔迪', '太谷能源管理', '泰达路业', '泰和润', '泰和兴材料', '泰极纸业', '泰瑞力克机械精工', '泰益欣股份', '特源特色开发', '腾达食品', '腾新', '天诚众一建设', '天地奔牛链条', '天地恒源', '天地华宇', '天地经纬电力设备', '天地元化工', '天地元环境', '天工', '天海食品', '天凯银科财税管理咨询', '天凯银科', '天隆海洋线缆', '天鹏智合大数据', '天然蜂产品开发', '天荣现代', '天润丰高管业',
         '天润禾', '天润农农机', '天顺成', '天通纸业', '天欣富宏农牧', '天雄碳材料', '天选云电子', '天一晟', '天胤电力通信', '天鹰同创', '天佑', '天缘祺电力', '天之谷食品', '天筑予景设计咨询', '天纵泓光余热发电股份', '甜橙', '铁辰环境', '通标产品质量检验测试研究中心', '通昶物流', '通力', '通特工贸', '通信规划设计院', '通信建设', '通宇电梯股份', '同望咨询', '同盈现代', '图兰朵酒业', '万国', '万恒人防特种防护设备', '万鸿环境', '万辉', '万惠', '万界', '万颗综合开发', '万牧山农牧', '万仕隆冷冻股份',
         '万通新型建材', '万维智联', '万亿', '万众机械化', '王杰农资经营', '网虫传媒', '网界智慧', '网信创安', '网运通数字', '旺源众禾', '威尔信', '威科嘉动物', '威睿', '微利信机械设备', '微众', '维尔康环境检测', '维华新兴建设', '维水源化工产品', '维益电气', '维益电子', '伟昌钢化玻璃', '伟创药业', '伟航创业', '纬通', '未来', '味福季食品', '味尤美食品', '蔚来视界', '蔚来研究院', '文掌柜食品', '闻墨科贸', '蜗牛', '沃尔丰葡萄酒', '沃美达', '沃源犇洲农牧', '沃之源', '无为', '无线互通', '梧桐树孵化',
         '五丰', '五维', '武发工贸', '西贝农林牧生态', '西部绿谷节水', '西部皮草', '西部云科', '西诚软件股份', '西格马农牧业', '西格玛', '西谷六方机电设备', '西渠华仁农林', '西戎物联', '西夏种业', '西月花卉', '西竹食品', '希望田野', '希望股份', '玺鹿', '夏能', '夏瑞', '夏盛', '夏禹节水', '先禾传媒', '先科电力设计咨询', '鲜丰开发', '祥瑞升生态环境', '祥瑞', '祥云传播', '享誉', '向量', '骁啸光电', '霄霞生态股份', '小巨人', '小牛设备股份', '小任果蔬现代', '晓鸣农牧股份', '校萌', '协成电气',
         '协力装备', '芯电数字', '芯印象', '昕能电力', '昕远通交通', '欣奥化工', '欣达节能', '欣光泰电力', '欣凯烨', '欣迈建设', '欣烨包装制品', '欣源绿逸', '新阿里生态', '新澳农牧', '新澳羊绒', '新百丰', '新彩建设', '新创艺', '新东方食用油', '新丰益节能', '新阜特能源', '新航', '新鸿科液压', '新华物流股份', '新慧彬葡萄酒庄', '新金凰印刷', '新明润源', '新起点现代装备', '新瑞长城机床', '新瑞铸造', '新世线国际会展', '新思科管理咨询', '新中绒羊绒服装', '新中意门业', '歆通物流', '歆宇供应链',
         '鑫柏瑞', '鑫昌广源装饰', '鑫晨玉润', '鑫尔特', '鑫沣', '鑫昊石建材', '鑫昊源农牧开发', '鑫煌绒业', '鑫嘉年华汽车维修', '鑫晶盛电子材料', '鑫磊建设检测', '鑫泰', '鑫泰牧业', '鑫通道路咨询', '鑫旺铝业', '鑫新顺达农牧', '鑫洋门窗', '鑫烨', '鑫优仕', '鑫佑门窗', '鑫源伟业企业管理', '鑫之翊咨询', '鑫之翊', '信安永达', '信德恒源', '信通', '信友监理咨询管理股份', '信准检测', '星辰医疗器械', '星航', '星瀛', '行云', '兴电监理', '兴华互通供应链', '兴华宇天然物产', '兴捷报废汽车回收', '兴灵粮油',
         '兴日晟', '兴盛驾驶员培训', '兴唐米业', '兴亚节能', '兴源达农牧', '兴卓交通建设', '雄牛酒业', '雄仕达汽车', '雄越农牧专业合作社', '旭景川夏', '轩禾源农牧', '玄瓷', '雪福多食品', '讯浦通讯', '迅海', '迅联', '巽坤合巨开发', '言辰', '阳光开发', '遥创物联网', '一粒丰', '一面香传食品加工', '一沐智云', '一山', '伊地地质', '伊禾食品', '伊佳仁食品', '伊凯能源管理节能', '伊瑞朵食品', '壹诺', '壹泰牧业', '宜能', '以鲜冠', '亿博丰担保品管理', '亿车', '亿次元', '亿丰建设', '亿伏',
         '亿嘉阳光国际贸易', '亿嘉益机械设备', '亿能固体废弃物资源化开发', '亿智慧', '艺丰', '艺乐升辉', '艺盟礼益艺术品', '亦浓酒庄', '亦生', '易宸天智', '易聚高显光电', '易龙咨询', '易通联创', '易兴', '易讯通电子', '奕华盛', '奕昇', '益丰智慧', '益君面粉', '益农利牧农牧', '益农投资咨询', '益农', '益千佳', '益智电子商务', '逸城中通建材', '逸帆卫宁', '逸凡包装', '翊昊宏翔', '翌博信', '茵迪通信', '银安', '银报印刷', '大河数控机床', '银得利', '银方', '银福鼎食品', '银河仪表', '银恒紧固件',
         '银湖农林牧开发', '银华铝业', '银利电气股份', '银松', '银兴', '银亚钢结构', '银洲通信咨询', '饮和食品', '英杰达', '英泰力', '迎鑫达门窗装饰', '赢盾', '永澳源农牧', '永和光福', '永丽丰', '永农科学', '永煦模板', '勇峰', '优跃', '友麟开发', '有梦青年电子商务', '有为', '佑安安全咨询', '于味鲜食品', '渔掌门生态旅游', '与声聚莱传媒', '宇邦', '宇成蓝天输送设备', '宇华伟业量仪精密铸造', '宇能链物流', '宇信通', '禹泉', '禹羿', '玉林洋食用油', '玉泉肥料', '玉山机械设备', '昱博市政建设',
         '昱皓软件', '钰瑶鑫晟农牧', '裕凌丰食品', '煜州电子', '誉兴包装印刷', '毓晨电机维修', '元创安环', '元昊电力', '元蔚', '原歌葡萄酒庄股份有', '圆惠', '源安咨询', '源采', '源码', '源森炽', '源众', '远诚', '远大城建工业', '远帆企业管理咨询', '远鹏建设', '阅动矩阵', '阅润', '悦丰生态股份', '悦海农牧开发', '悦养', '跃尚元应用', '云从', '云桦智慧能源', '云控物联网', '云联智享', '云泰源农牧', '云图勘测规划', '云网智信', '云信达', '云叶', '云逸智联数字', '昀启昕机械再', '运富祥机械', '泽辉节能',
         '泽瑞隆', '泽瑞生态养殖牧业', '泽新', '泽艺洲装饰', '泽友', '展信', '占龙牧业开发', '长鼎夜视新开发', '长和翡翠酒庄', '长宏康', '长济', '长骏咨询', '长庆石油机械', '长兴精密机械', '兆瑞电力', '珍祥机械', '真新鲜供应链管理', '甄选', '臻牛农牧', '振国米业', '振鑫', '镇朔科贸', '征信', '正邦品牌管理', '正德源股份', '正合安', '正普流体设备', '正禹', '正源建设监理', '正源', '正筑建设', '政安', '政诚检测', '知策', '知光', '植安农林', '指数', '至信万合', '志成知识产权代理', '志辉建材',
         '志辉砂石', '志忠工业固体废物处置', '致远互联软件', '智安电力', '智柏健康', '智辰', '智诚智谷', '智达咨询', '智德', '智恒鑫', '智弘', '智惠宁安安防', '智慧宫传媒', '智教', '智杰伟业软件', '智控能源', '智联检测科学研究所', '智林', '智信管理咨询', '中博供应链', '中测计量测试检验院', '中测计量测试检验院', '中创科工贸', '中创', '中德易家', '中电联创电气', '中梵数智', '中昊银晨能源', '中禾瑞丰生态', '中和永利', '中宏国建检测', '中环光伏材料', '中环国安咨询', '中环绿色规划设计院', '中建万喜',
         '中景润通', '中科恒瑞', '中科精科检测', '中科欧德', '中科瑞达光电', '中科天际防雷检测', '中科天际防雷研究院', '中科物联', '中米', '中农生态开发', '中青', '中瑞祥机械', '中胜勘测规划设计院', '中盛建材', '中时', '中拓机械', '中泰富瑞', '中碳节能', '中天昊广告装饰', '中天经纬咨询', '中投数字', '中图咨询', '中微泰克', '中维板业', '中小在线', '中欣晶圆半导体', '中旭基业', '中岩基业建设', '中耀环能', '中移和创', '中振电力', '中正华远', '中知视界', '中铸合金材料', '中自慧博机电设备', '中尊',
         '忠鑫通物流', '仲检检测', '众安消防安全', '众创基业电气', '众发制冷', '众合天诚科工贸', '众合远大电力设计', '众和绿源', '众力管廊', '众森生态环境', '众鑫宸', '众鑫鸿建设', '众盈机械', '众宇', '众源建材', '众远电缆', '众志高远', '众志好活', '重立机械', '周景世荣进出口', '洲洋制药', '祝融数字孪生', '筑云', '筑之信检测', '倬昱', '卓创源彩色印务', '卓萃包装', '梓恒', '紫辉商贸', '自然之星', '纵横宝盈股份', '纵横焦点', '配网电气', '启迪水联网', '启明云智', '启天通信管业', '乾藏灸', '融拓',
         '瑞可仕', '赛迈科先进材料', '赛瑞工信', '三凯国际', '三智未来', '森硕', '森阳建设', '善水博通环境', '上海华源药业沙赛制药', '上海胜华电缆', '盛世百纳会务', '世达新科供应链管理', '数云传智', '斯特朗', '泰极纸业', '泰山石膏', '滩羊鲜生牧业专业合作社', '汤姆森电气', '特变交联线缆', '特斯联', '天地支护装备', '天津大桥焊丝', '天链数据', '天链数据', '天庆', '天瑞豪源', '天通银厦', '图新设计咨询', '沃丰智慧', '卧龙电气变压器', '吾特特传播', '西北轴承', '西部安全认证中心', '西部第三方检测',
         '西部电子商务股份', '西部新能电力设计', '夏茸', '鲜控', '鲜控', '心梦想科创管理', '心芯', '心芯', '欣科', '新上仕', '信恒工业', '兴乐电缆', '徐州中煤钢结构建设', '迅驰工业', '一工机器人', '壹禾控股', '阿凡达机器人', '艾齿口腔医院', '艾尼工业开发股份', '艾森达', '爱必达园艺', '爱如生', '奥特股份', '保绿特', '贝昂得医学检验实验室', '贝尔利', '边塞人家食品', '博康医院', '诚净和机械设备', '大前进咨询', '大重化工设备', '戴尔瑞养殖种植专业合作社', '导医通互联网医院', '德钢机械', '德锐斯工贸',
         '电气配套设备', '丁香互联网医院', '东方气力运输设备', '方达电子系统', '凤仪堂', '国基巩固', '昊宇通汽车检测', '浩科咨询', '合宜', '恒瑞通彩色印刷', '恒源兴银砼业', '衡正信诚检测', '弘瑞达工贸', '弘跃', '红日电线电缆', '鸿胜盈隆新型保温材料', '鸿盛果蔬种植专业合作社', '华安医院', '华信智', '汇成', '汇庆电力工贸', '嘉翔', '健康医疗数字', '金沃精工', '精齿机械', '军浩兰砼业', '凯创机械', '康地反刍动物营养', '科海', '鲲鹏出海', '兰达化工', '蓝电电力高压', '蓝杰机床附件', '老绵羊食品',
         '雷利祥电气', '连华', '林茂玻璃', '隆基光伏', '隆基硅材料', '绿之川园艺专业合作社', '美食美客食品', '美中嘉和互联网医院', '珉玉电子', '明能电气', '蒲尚葡萄酒', '普软', '七彩涂饰', '乾景电子', '俏王婆食品', '清华紫光', '庆丰丰达', '仁达无害化处理', '融神威仪表厂', '瑞安祥消防安全', '瑞海陈咨询', '瑞通方胜', '润泽源节水', '三利酱醋', '森淼', '上医堂中医医院', '市艾尼散热器', '市成通建设', '市城市规划设计研究院', '市川雨节水灌溉', '市房地产测绘中心', '市富邦印刷包装', '市富泰华家具',
         '市供水水质监测研究所', '市山莲花山建材', '市恒益达机械', '市华银电线电缆', '市乐味食品', '市立恒电气设备', '市联合商检', '市容尔', '市长城液压', '市正禹水利水电质量检测', '市致远出租汽车', '市智卓信', '市综合检验检测', '蔬果鲜蔬菜专业合作社', '思思食品', '四海丰盈保温材料', '松林数控', '特种轴承', '天恩电气', '天脉', '天一海腾工贸', '天源盛衡器', '天卓', '田永成医学美容', '铁狮设备', '通昌绿洁日化', '通达', '图泰克', '图泰克模具', '网星电子', '威力传动股份', '威马电机',
         '维视阅互联网医院', '文达新机械', '沃尔森节水灌溉', '西部大森数控', '喜乐互联网医院', '翔峰制冷', '翔通公交传媒', '欣安瑞电气', '信远轴承', '一方玻璃棉', '伊百盛', '伊光食品厂', '伊品香油脂', '怡祥电力设备维修', '怡祥矿山机械', '银丰食品', '银戈', '英奥特自控股份', '优医达互联网医院', '猿创互联网医院', '展芯', '正人', '知微', '致皓义齿', '致远交建', '智慧城市', '智慧冷链物流', '智慧食品安全检验检测中心', '智慧', '中博联合电气', '中电光谷', '中房物业', '中科电力', '中科元昊',
         '中小在线资信', '中轴智造小镇', '卓一园林绿化', '县昊香源食用油', '县惠丰现代种植专业合作社', '县伟国专业合作社', '县信杰食用菌专业合作社', '友连', '煜金达建材', '阅宁', '云铂', '云舟能源', '泽昕', '长燃智享', '长燃智享', '长润安测', '长润放射', '知了', '智感', '智芯慧融数字', '智瀛', '中晟运达供应链管理', '中电建', '中电科翌智航', '中电算力应用', '中发建业环境', '中航股份', '中环科工生态环境设计院', '中技安全', '中交基础设施养护', '中节能国机联合电力', '中节能股份', '中科嘉创碳金',
         '中科天际股份', '中联玉德设计咨询', '中粮长城葡萄酒', '中亮', '中霖思源生态', '中能投  电力', '中启源', '中启源', '中天云创', '中铁建大桥局西北', '中通创新与', '中新重远(）检测', '中英阿诺康', '中源智信  电力', '中云天创', '中再云汇', '中再云汇', '仲检', '仲检检测', '重立', '紫夏']

rows = []

for name in names:
    params = {
        "query": name,
        "region": "宁夏",
        "region_limit": "true",
        "output": "json",
        "ak": ak,
    }

    response = requests.get(url, params=params)
    data = response.json()

    print("查询：", name)
    print(data)

    # 注意：百度字段名是  results  而不是 result
    if data.get("status") == 0 and data.get("results"):
        res = data["results"][0]

        row = {
            "input_name": name,
            "name": res.get("name", ""),
            "tag": res.get("tag", ""),
            "province": res.get("province", ""),
            "city": res.get("city", ""),
            "district": res.get("district", ""),
            "town": res.get("town", ""),
            "address": res.get("address", ""),
            "lat": res.get("location", {}).get("lat", ""),
            "lng": res.get("location", {}).get("lng", "")
        }
    else:
        row = {
            "input_name": name,
            "name": "",
            "tag": "",
            "province": "",
            "city": "",
            "district": "",
            "town": "",
            "address": "",
            "lat": "",
            "lng": ""
        }
        time.sleep(0.3)

    rows.append(row)

# 保存 CSV
df = pd.DataFrame(rows)
df.to_csv("baidu_place_search_result.csv", index=False, encoding="utf-8-sig")

print("\nCSV 已生成：baidu_place_search_result.csv")
